ecommerce_api/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "stock", "created_at", "updated_at") VALUES ('Produto Exemplo', 'Descrição do produto.', 99.99, 10, '2025-01-06 20:08:46.427244', '2025-01-06 20:08:46.427244') RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    if @product.save

UPDATE "products" SET "price" = 10.01, "stock" = 12, "updated_at" = '2025-01-06 21:29:17.649721' WHERE "products"."id" = 3
---
  def update
    if @product.update(product_params)